from detect_name import detect_name_and_group

List_string = ['นายพศิน บัวขาว หรือ นายชเนตตี ทิวเกตุตรงหรือ นายวรายุทธ แซ่หนา หรือ นายณัฐวัตร สว่าง หรือ นายศุภณัฐ สร้อยเพชร ลงลายมือชื่อร่วมกับนายปัทมา ยอดทอง หรือ นายฐิรพรรษ ปานทอง หรือ นายธีรดนย์ แก้วนก หรือ นายธนะพันธ์ ญาณอัมพร',
               'กรรมการคนใดคนหนึ่งจากกรรมการกลุ่ม ก.หนึ่งคนลงลายมือชื่อร่วมกับกรรมการคนใดคนหนึ่งจากรรมการกลุ่ม ข.หนึ่งคนรวมเป็นสองคน ซึ่งกรรมการกลุ่ม ก. คือ นางวรนัยน์ นางาซาวา นายธิรวริทธิ์ ปิติพิพัฒน์และนายศศิกานต์ เลิศพิพัฒน์กิจ กรรมการกลุ่ม ข. คือ นายภคิน จตุปัญญาโชติกุลนายคาเมรอน ไมเคิล ฮูมนายก้องภพ กองเกียรติเจริญและนายเจมส์ เอ็ดเวิร์ด ซัลลิแวน เบิร์ช']

for i in range(len(List_string)):
    print(detect_name_and_group([List_string[i]]))